In [1]:
from datetime import datetime

In [2]:
time_data = '2024-03-26 09:45:00'
print(type(time_data))

<class 'str'>

In [4]:
time = datetime.strptime(
    time_data,
    "%Y-%m-%d %H:%M:%S"
)
print(time)
print(type(time))

2024-03-26 09:45:00
<class 'datetime.datetime'>

In [7]:
time_data2 = '2024년03월'
time2 = datetime.strptime(
    time_data2,
    '%Y년%m월'
)
print(time2)

2024-03-01 00:00:00

In [8]:
time2.strftime('%Y년%m월')

'2024년03월'

In [9]:
import pandas as pd

In [10]:
pd.Timestamp(year = 2024, month = 3, day = 27)

Timestamp('2024-03-26 00:00:00')

In [11]:
time_data3 = '2024-03-27'
pd.to_datetime(time_data3)

Timestamp('2024-03-27 00:00:00')

In [12]:
time_data4 = '2024년3월'
pd.to_datetime(time_data4,
               format = '%Y년%m월')

Timestamp('2024-03-01 00:00:00')

In [13]:
tran_1 = pd.read_csv("../csv/tran_1.csv")
tran_2 = pd.read_csv("../csv/tran_2.csv")
tran_d1 = pd.read_csv("../csv/tran_d_1.csv")
tran_d2 = pd.read_csv("../csv/tran_d_2.csv")

In [16]:
tran = pd.concat([tran_1, tran_2], axis = 0 , ignore_index = True )
tran

     transaction_id   price         payment_date customer_id
0       T0000000113  210000  2019-02-01 01:36:57    PL563502
1       T0000000114   50000  2019-02-01 01:37:23    HD678019
2       T0000000115  120000  2019-02-01 02:34:19    HD298120
3       T0000000116  210000  2019-02-01 02:47:23    IK452215
4       T0000000117  170000  2019-02-01 04:33:46    PL542865
...             ...     ...                  ...         ...
6781    T0000006894  180000  2019-07-31 21:20:44    HI400734
6782    T0000006895   85000  2019-07-31 21:52:48    AS339451
6783    T0000006896  100000  2019-07-31 23:35:25    OA027325
6784    T0000006897   85000  2019-07-31 23:39:35    TS624738
6785    T0000006898   85000  2019-07-31 23:41:38    AS834214

[6786 rows x 4 columns]

In [17]:
tran.isna().any()

transaction_id    False
price             False
payment_date      False
customer_id       False
dtype: bool

In [18]:
tran['transaction_id'].value_counts()

transaction_id
T0000000113    1
T0000004645    1
T0000004643    1
T0000004642    1
T0000004641    1
              ..
T0000002372    1
T0000002371    1
T0000002370    1
T0000002369    1
T0000006898    1
Name: count, Length: 6786, dtype: int64

In [22]:
tran_d = pd.concat([tran_d1, tran_d2], axis = 0, ignore_index= True)

In [23]:
tran_d

      detail_id transaction_id item_id  quantity
0             0    T0000000113    S005         1
1             1    T0000000114    S001         1
2             2    T0000000115    S003         1
3             3    T0000000116    S005         1
4             4    T0000000117    S002         2
...         ...            ...     ...       ...
7139       7139    T0000006894    S004         1
7140       7140    T0000006895    S002         1
7141       7141    T0000006896    S001         2
7142       7142    T0000006897    S002         1
7143       7143    T0000006898    S002         1

[7144 rows x 4 columns]

In [30]:
len(tran_d['transaction_id'].unique())

6786

In [ ]:
offline = pd.read_csv('../../csv/card/오프라인.csv', encoding = 'CP949')
offline.columns = ['기준년월', '업종', '성별', '연령대', '총이용건수', '총이용금액']
offline['기준년월'] = pd.to_datetime(offline['기준년월'], format = '%Y%m' )
offline['기준년'] = offline['기준년월'].dt.strftime("%Y")
offline['건당이용금액'] = offline['총이용금액'] / offline['총이용건수']
group_data = offline[['성별','기준년','건당이용금액']].groupby(['성별', '기준년']).mean()
pivot_data = offline.pivot_table(
    index = '성별',
    columns = '기준년',
    values = '건당이용금액',
    aggfunc = 'mean'
)
group_data.stack()  
offline.set_index('기준년월', inplace = True)
pivot_data2 = offline.pivot_table(
    index = '기준년월',
    columns = '업종',
    values = '총이용금액',
    aggfunc = 'sum'
)